probe-rs/probe-rs-debugger-test/svd_files/STM32C031C6Tx.svd
          <register>
            <name>SYSCFG_CFGR3</name>
            <displayName>SYSCFG_CFGR3</displayName>
            <description>SYSCFG configuration register 3 </description>
            <addressOffset>0x3c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PINMUX0</name>
                <description>Pin GPIO multiplexer 0
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved
Pin F2 of WLCSP14 package GPIO assignment
1x: Reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_1</name>
                    <description>PB7</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_1</name>
                    <description>PC14</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_F2</name>
                    <description>PA1</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_F2</name>
                    <description>PA2</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PINMUX1</name>
                <description>Pin GPIO multiplexer 1
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                    <description>PF2</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                    <description>PA0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                    <description>PA1</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                    <description>PA2</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_G3</name>
                    <description>PF2</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_G3</name>
                    <description>PA0</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PINMUX2</name>
                <description>Pin GPIO multiplexer 2
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved
1x: Reserved</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_5</name>
                    <description>PA8</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_5</name>
                    <description>PA11</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_J1</name>
                    <description>PA8</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_J1</name>
                    <description>PA11</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PINMUX3</name>
                <description>Pin GPIO multiplexer 3
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_8</name>
                    <description>PA14</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_8</name>
                    <description>PB6</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_8</name>
                    <description>PC15</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_H2</name>
                    <description>PA5</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_H2</name>
                    <description>PA6</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PINMUX4</name>
                <description>Pin GPIO multiplexer 4
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved
1x: Reserved</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_E2</name>
                    <description>PA7</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_E2</name>
                    <description>PA12</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_G1</name>
                    <description>PA7</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_G1</name>
                    <description>PA12</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PINMUX5</name>
                <description>Pin GPIO multiplexer 5
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                    <description>PA3</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                    <description>PA4</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                    <description>PA5</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                    <description>PA6</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x0_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_J3</name>
                    <description>PA3</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1_STM32C031X___GPIO_ASSIGNED_TO_WLCSP14_PIN_J3</name>
                    <description>PA4</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE0</name>
            <displayName>SYSCFG_ITLINE0</displayName>
            <description>SYSCFG interrupt line 0 status register </description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>WWDG</name>
                <description>Window watchdog interrupt pending flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE2</name>
            <displayName>SYSCFG_ITLINE2</displayName>
            <description>SYSCFG interrupt line 2 status register </description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RTC</name>
                <description>RTC interrupt request pending (EXTI line 19)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE3</name>
            <displayName>SYSCFG_ITLINE3</displayName>
            <description>SYSCFG interrupt line 3 status register </description>
            <addressOffset>0x8c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>FLASH_ITF</name>
                <description>Flash interface interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE4</name>
            <displayName>SYSCFG_ITLINE4</displayName>
            <description>SYSCFG interrupt line 4 status register </description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>RCC</name>
                <description>Reset and clock control interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE5</name>
            <displayName>SYSCFG_ITLINE5</displayName>
            <description>SYSCFG interrupt line 5 status register </description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EXTI0</name>
                <description>EXTI line 0 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI1</name>
                <description>EXTI line 1 interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE6</name>
            <displayName>SYSCFG_ITLINE6</displayName>
            <description>SYSCFG interrupt line 6 status register </description>
            <addressOffset>0x98</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EXTI2</name>
                <description>EXTI line 2 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI3</name>
                <description>EXTI line 3 interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE7</name>
            <displayName>SYSCFG_ITLINE7</displayName>
            <description>SYSCFG interrupt line 7 status register </description>
            <addressOffset>0x9c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>EXTI4</name>
                <description>EXTI line 4 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI5</name>
                <description>EXTI line 5 interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI6</name>
                <description>EXTI line 6 interrupt request pending</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI7</name>
                <description>EXTI line 7 interrupt request pending</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI8</name>
                <description>EXTI line 8 interrupt request pending</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI9</name>
                <description>EXTI line 9 interrupt request pending</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI10</name>
                <description>EXTI line 10 interrupt request pending</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI11</name>
                <description>EXTI line 11 interrupt request pending</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI12</name>
                <description>EXTI line 12 interrupt request pending</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI13</name>
                <description>EXTI line 13 interrupt request pending</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI14</name>
                <description>EXTI line 14 interrupt request pending</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXTI15</name>
                <description>EXTI line 15 interrupt request pending</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE9</name>
            <displayName>SYSCFG_ITLINE9</displayName>
            <description>SYSCFG interrupt line 9 status register </description>
            <addressOffset>0xa4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DMA1_CH1</name>
                <description>DMA1 channel 1interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE10</name>
            <displayName>SYSCFG_ITLINE10</displayName>
            <description>SYSCFG interrupt line 10 status register </description>
            <addressOffset>0xa8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DMA1_CH2</name>
                <description>DMA1 channel 2 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>DMA1_CH3</name>
                <description>DMA1 channel 3 interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE11</name>
            <displayName>SYSCFG_ITLINE11</displayName>
            <description>SYSCFG interrupt line 11 status register </description>
            <addressOffset>0xac</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DMAMUX</name>
                <description>DMAMUX interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE12</name>
            <displayName>SYSCFG_ITLINE12</displayName>
            <description>SYSCFG interrupt line 12 status register </description>
            <addressOffset>0xb0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ADC</name>
                <description>ADC interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
