probe-rs/probe-rs-debugger-test/svd_files/STM32C031C6Tx.svd
          <register>
            <name>SYSCFG_ITLINE13</name>
            <displayName>SYSCFG_ITLINE13</displayName>
            <description>SYSCFG interrupt line 13 status register </description>
            <addressOffset>0xb4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM1_CCU</name>
                <description>Timer 1 commutation interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TIM1_TRG</name>
                <description>Timer 1 trigger interrupt request pending</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TIM1_UPD</name>
                <description>Timer 1 update interrupt request pending</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TIM1_BRK</name>
                <description>Timer 1 break interrupt request pending</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE14</name>
            <displayName>SYSCFG_ITLINE14</displayName>
            <description>SYSCFG interrupt line 14 status register </description>
            <addressOffset>0xb8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM1_CC</name>
                <description>Timer 1 capture compare interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE16</name>
            <displayName>SYSCFG_ITLINE16</displayName>
            <description>SYSCFG interrupt line 16 status register </description>
            <addressOffset>0xc0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM3</name>
                <description>Timer 3 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE19</name>
            <displayName>SYSCFG_ITLINE19</displayName>
            <description>SYSCFG interrupt line 19 status register </description>
            <addressOffset>0xcc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM14</name>
                <description>Timer 14 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE21</name>
            <displayName>SYSCFG_ITLINE21</displayName>
            <description>SYSCFG interrupt line 21 status register </description>
            <addressOffset>0xd4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM16</name>
                <description>Timer 16 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE22</name>
            <displayName>SYSCFG_ITLINE22</displayName>
            <description>SYSCFG interrupt line 22 status register </description>
            <addressOffset>0xd8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM17</name>
                <description>Timer 17 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE23</name>
            <displayName>SYSCFG_ITLINE23</displayName>
            <description>SYSCFG interrupt line 23 status register </description>
            <addressOffset>0xdc</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>I2C1</name>
                <description>I2C1 interrupt request pending, combined with EXTI line 23</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE25</name>
            <displayName>SYSCFG_ITLINE25</displayName>
            <description>SYSCFG interrupt line 25 status register </description>
            <addressOffset>0xe4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SPI1</name>
                <description>SPI1 interrupt request pending</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE27</name>
            <displayName>SYSCFG_ITLINE27</displayName>
            <description>SYSCFG interrupt line 27 status register </description>
            <addressOffset>0xec</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>USART1</name>
                <description>USART1 interrupt request pending, combined with EXTI line 25</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SYSCFG_ITLINE28</name>
            <displayName>SYSCFG_ITLINE28</displayName>
            <description>SYSCFG interrupt line 28 status register </description>
            <addressOffset>0xf0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>USART2</name>
                <description>USART2 interrupt request pending (EXTI line 26)</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
